Обработки/Reports/_ИтоговыйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ИтоговыйОтчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ИтоговыйОтчет/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Итоговый отчет",
		"0.54",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение",	ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык",				ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект",			ЭтотОбъект.Организация);
	
	СтруктураКлюча.Вставить("КонтактноеЛицо", НастройкиОтчета.ПодписантРуководитель);
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча));
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение",	ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык",				ПредопределенноеЗначение("Справочник.Языки.Русский"));
	ЮрЛицо = РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицоСчетаДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания);		
	СтруктураКлюча.Вставить("Объект",			ЮрЛицо);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат, Новый ТабличныйДокумент);	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
		
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ПодписантРуководитель");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Настройки.Добавить("ПодписантОтКлиента");
	Возврат Настройки;

КонецФункции

Функция ВернутьФИОПодписанта(Подписант, ЭтоСотрудник, Период, Организация)
	
	ФИО = Новый Структура;
	
	Если ТипЗнч(Подписант) = Тип("СправочникСсылка.ЮрФизЛица") Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицСрезПоследних.Отчество КАК ФИОПолностью,
		|	РеквизитыФизическихЛицСрезПоследних.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицСрезПоследних.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицСрезПоследних.Отчество, 1, 1) + ""."" КАК ФИОСокращенно
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &ЮрФизЛицо
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицСрезПоследних";
		
		Если ЭтоСотрудник Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеквизитыФизическихЛицАнкетные", "РеквизитыСотрудниковОрганизации"); 
		КонецЕсли;
	
		Запрос.УстановитьПараметр("ЮрФизЛицо", Подписант);
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ФИО.Вставить("ФИОПолностью", Выборка.ФИОПолностью);
			ФИО.Вставить("ФИОСокращенно", Выборка.ФИОСокращенно);
			
		КонецЕсли;	
	Иначе //строка	
		СтрокаФИО = Подписант;
		
		Если Найти(СтрокаФИО, ".") > 0 Тогда         //только Фамилия И. О. 
			ФИО.Вставить("ФИОПолностью", СтрокаФИО);
			ФИО.Вставить("ФИОСокращенно", СтрокаФИО);
		Иначе	
			МассивФИО = СтрРазделить(СтрокаФИО, " ");
			Если МассивФИО.Количество() = 3 Тогда
				ФИОСокращенно = МассивФИО[0] + " " + Лев(МассивФИО[1],1) + ". " + Лев(МассивФИО[2],1) + ". ";
				
				ФИО.Вставить("ФИОПолностью", СтрокаФИО);
				ФИО.Вставить("ФИОСокращенно", ФИОСокращенно);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаФИО + " не является строкой типа ФИО");
			КонецЕсли;	
		КонецЕсли;
	
	КонецЕсли;	
	
	Возврат ФИО;
	
	
КонецФункции	

Процедура Сформировать(ДокументРезультат, ДокументРасшифровка)	Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументРезультат.Очистить();
	ДокументРасшифровка.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""комиссия РЕПО"" КАК Наименование,
		|	ЕСТЬNULL(-ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот, 0) КАК Сумма
		|ПОМЕСТИТЬ _Комиссии
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства18),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВЫРАЗИТЬ(КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаДоходовРасходов).Код В (""31310"", ""31311"", ""31312"", ""31313"", ""31314"", ""31315"", ""31316"", ""31317""),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы03),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""комиссия продажа"",
		|	ЕСТЬNULL(ОборотыРасходы.СуммаОборот, 0)
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			,
		|			СчетДТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ВыбытиеИРеализация10),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			СчетКТ В ИЕРАРХИИ (&СчетаДС),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОборотыРасходы
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""комиссия покупка"",
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот, 0)
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций04), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций06)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""комиссия покупка"",
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот, 0)
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций04)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВЫРАЗИТЬ(КорСубконто1 КАК Документ.Сделка).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка),
		|			КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов)) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""комиссия банка"",
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот, 0)
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета01),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""комиссия банка"",
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот, 0)
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|ГДЕ
		|	ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2 КАК Справочник.Договоры).ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.БанковскогоОбслуживания))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""прочие комиссии"",
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот, 0)
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			,
		|			СчетДТ = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02),
		|			,
		|			СчетКТ В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами02)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт, 0) КАК КапиталНачало,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт, 0) КАК КапиталКонец
		|ПОМЕСТИТЬ _Капитал
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			,
		|			,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт, 0) * &УчитыватьПереходНаМСФО9 КАК СуммаПерехода
		|ПОМЕСТИТЬ _ПереходНаМСФО9
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			НАЧАЛОПЕРИОДА(&ДатаНачальная, ГОД),
		|			&ДатаНачальная,
		|			,
		|			,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
		|ПОМЕСТИТЬ _ФинРез
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСТЬNULL(СУММА(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт), 0) КАК Сумма
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|				&ДатаНачальная,
		|				&ДатаКонечная,
		|				Период,
		|				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоРезервам), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыИРасходыПоДеятельностиПоНПО10)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)
		|					И ЛицевойСчетКор.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего),
		|				КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|				) КАК ЕдиныйБухгалтерскийУчетОбороты
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ЕСТЬNULL(СУММА(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт), 0)
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|				&ДатаНачальная,
		|				&ДатаКонечная,
		|				Период,
		|				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.НалогНаПрибыль)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|				КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыПоНалогуНаПрибыль),
		|				) КАК ЕдиныйБухгалтерскийУчетОбороты) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОбороты.Регистратор ССЫЛКА Документ.ВыводЦенныхБумаг
		|				ТОГДА ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Выводы,
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОбороты.Регистратор ССЫЛКА Документ.ВводЦенныхБумаг
		|				ТОГДА ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Вводы,
		|	НАЧАЛОПЕРИОДА(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ) КАК Период
		|ПОМЕСТИТЬ _ВводыВыводыДок
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			Регистратор,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего),
		|			КорСчет В ИЕРАРХИИ (&СчетаЦБ),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
		|				ТОГДА ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКорректировки,
		|	НАЧАЛОПЕРИОДА(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ) КАК Период
		|ПОМЕСТИТЬ _Корректировки
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			Регистратор,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего),
		|			КорСчет В ИЕРАРХИИ (&СчетаЦБ),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ЕдиныйБухгалтерскийУчетОбороты.Период, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""денежные средства"" КАК Наименование,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт, 0) КАК Выводы,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт, 0) КАК Вводы
		|ПОМЕСТИТЬ _ВводыВыводы
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета01),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""задолженность"",
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт, 0),
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт, 0)
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего),
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ценные бумаги"",
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА _ВводыВыводыДок.Выводы <> 0
		|					ТОГДА _ВводыВыводыДок.Выводы - _Корректировки.СуммаКорректировки
		|				ИНАЧЕ _ВводыВыводыДок.Выводы
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА _ВводыВыводыДок.Вводы <> 0
		|					ТОГДА _ВводыВыводыДок.Вводы + _Корректировки.СуммаКорректировки
		|				ИНАЧЕ _ВводыВыводыДок.Вводы
		|			КОНЕЦ), 0)
		|ИЗ
		|	_ВводыВыводыДок КАК _ВводыВыводыДок
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Корректировки КАК _Корректировки
		|		ПО _ВводыВыводыДок.Период = _Корректировки.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Вознаграждение депозитария"" КАК Наименование,
		|	ЕСТЬNULL(СУММА(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот), 0) КАК Сумма
		|ПОМЕСТИТЬ _Вознаграждения
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|ГДЕ
		|	(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2 КАК Справочник.Договоры).ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СпецДепозитарногоОбслуживания))
		|			ИЛИ ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2 КАК Документ.НачислениеЗадолженности).ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария)))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Расходы депозитария"",
		|	ЕСТЬNULL(СУММА(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот), 0)
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|ГДЕ
		|	(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2 КАК Справочник.Договоры).ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ДепозитарногоОбслуживания), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ОтветственногоХранения), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ВеденияРеестра), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СпецРегистрационногоОбслуживания))
		|			ИЛИ ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2 КАК Документ.НачислениеЗадолженности).ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария)))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Вознаграждение управляющей компании"",
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот, 0)
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			,
		|			СчетДТ В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыИРасходыПоДеятельностиПоНПО10)),
		|			,
		|			СчетКТ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчетКт.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Вознаграждение управляющей компании"",
		|	ЕСТЬNULL(-ЕдиныйБухгалтерскийУчетОборотыДтКт.СуммаОборот, 0)
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОборотыДтКт(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			,
		|			СчетДТ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ)),
		|			,
		|			СчетКТ В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыИРасходыПоДеятельностиПоНПО10)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчетКт.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОборотыДтКт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СУММА(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт - ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт), 0) КАК Сумма
		|ПОМЕСТИТЬ _Прирост
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего),
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоРезервам), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыИРасходыПоДеятельностиПоНПО10)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты";
	
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления); 

	Если Год(ЭтотОбъект.Период.ДатаНачала) = 2025 
		И НачалоГода(ЭтотОбъект.Период.ДатаНачала) = НачалоДня(ЭтотОбъект.Период.ДатаНачала) Тогда
		Запрос.УстановитьПараметр("ДатаНачальная", ЭтотОбъект.Период.ДатаНачала + 2); //Надо учеть смену учетной политики в 2025 г.
		Запрос.УстановитьПараметр("УчитыватьПереходНаМСФО9", 1); 
	Иначе
		Запрос.УстановитьПараметр("ДатаНачальная", ЭтотОбъект.Период.ДатаНачала);
		Запрос.УстановитьПараметр("УчитыватьПереходНаМСФО9", 0);  
		//= если строим не с начала года, то была реформация, переход не нужен
	КонецЕсли;  
	
	Запрос.УстановитьПараметр("ДатаКонечная", ЭтотОбъект.Период.ДатаОкончания);
	
	СчетаДС = Новый Массив;
	СчетаДС.Добавить(ПланыСчетов.Единый.РасчетныеСчета);
	СчетаДС.Добавить(ПланыСчетов.Единый.РасчетыСБрокерами);
	СчетаДС.Добавить(ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05);
	СчетаДС.Добавить(ПланыСчетов.Единый.Расчеты22);
	Запрос.УстановитьПараметр("СчетаДС", СчетаДС);
	
	СчетаЦБ = Новый Массив;
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеПоСправедливой);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.УчастиеВДочернихОбществахИПаевыхФондах);
	Запрос.УстановитьПараметр("СчетаЦБ", СчетаЦБ);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания);	
	ДатаНачалаДоговора = ПолучитьДатуПервогоВвода();
	Если ДатаНачалаДоговора = Неопределено Тогда 
		ДатаНачалаДоговора = СведенияОбОрганизации.ДатаДоговора;
	КонецЕсли;	
	
	Отчет = ПолучитьМакет("Отчет"); 
	Если ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями Тогда 
		ОбластьОтчет = Отчет.ПолучитьОбласть("ОтчетПН");		
	ИначеЕсли ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами Тогда 
		ОбластьОтчет = Отчет.ПолучитьОбласть("ОтчетПР");	
	ИначеЕсли ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов Тогда 
		ОбластьОтчет = Отчет.ПолучитьОбласть("ОтчетСС");
	ИначеЕсли ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний Тогда	
		ОбластьОтчет = Отчет.ПолучитьОбласть("ОтчетСтраховыеРезервы");  
	ИначеЕсли ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний Тогда	
		ОбластьОтчет = Отчет.ПолучитьОбласть("ОтчетИмуществоСК");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для договора " + ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления + " отчет не предусмотрен.");
		Возврат;
	КонецЕсли;	

	Расшифровка = ПолучитьМакет("Расшифровка");
	ОбластьРасшифровка = Расшифровка.ПолучитьОбласть("Расшифровка");
	
	Если КонецДня(ЭтотОбъект.Период.ДатаОкончания) = КонецГода(ЭтотОбъект.Период.ДатаОкончания) Тогда 
		ВГоду = "в " + Формат(Год(ЭтотОбъект.Период.ДатаОкончания),"ЧГ=0") + " году";
		ЗаГод = "за " + Формат(Год(ЭтотОбъект.Период.ДатаОкончания),"ЧГ=0") + " год";
	Иначе	
		ВГоду = "за период с " + Формат(ЭтотОбъект.Период.ДатаНачала,"ДФ=dd.MM.yyyy") + " по " + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy") + " года";
		ЗаГод = ВГоду;
	КонецЕсли;	
	
	// 
	ОбластьОтчет.Параметры.ДатаОтчета = Формат(ЭтотОбъект.Период.ДатаОкончания,"ДЛФ=DD");
	ОбластьОтчет.Параметры.НомерДоговора = СведенияОбОрганизации.НомерДоговора;
	ОбластьОтчет.Параметры.ДатаДоговора = СтрЗаменить(Формат(СведенияОбОрганизации.ДатаДоговора,"ДЛФ=DD"), "г.", "");
	//ОбластьОтчет.Параметры.Год = Формат(Год(ЭтотОбъект.Период.ДатаОкончания),"ЧГ=0"); 
	ОбластьОтчет.Параметры.ВГоду = ВГоду; 
	ОбластьОтчет.Параметры.ЗаГод = ЗаГод; 
	
	ОбластьОтчет.Параметры.НачалоПериода = СтрЗаменить(Формат(Макс(ЭтотОбъект.Период.ДатаНачала, ДатаНачалаДоговора),"ДЛФ=DD"), "г.", "");	
	ОбластьОтчет.Параметры.КонецПериода = Формат(ЭтотОбъект.Период.ДатаОкончания,"ДЛФ=DD");	
	
	ОбластьОтчет.Параметры.НаименованиеКлиент = СведенияОбОрганизации.ПолноеНаименование; 
	ОбластьОтчет.Параметры.НаименованиеУК = СведенияОбОрганизации.ПолноеНаименованиеОрганизации; 	
	
	// заполнение строк 
	ВыборкаКапитал = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Капитал").ПолучитьДанные().Выбрать();
	Если ВыборкаКапитал.Следующий() Тогда 
		ОбластьОтчет.Параметры.КапиталНачало = ВыборкаКапитал.КапиталНачало;
		ОбластьОтчет.Параметры.КапиталКонец = ВыборкаКапитал.КапиталКонец;
		ОбластьОтчет.Параметры.КапиталНачалоПропись = ЧислоПрописью(ВыборкаКапитал.КапиталНачало, "Л = ru_RU; НП = Истина; НД = Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек, ж,2");
		ОбластьОтчет.Параметры.КапиталКонецПропись = ЧислоПрописью(ВыборкаКапитал.КапиталКонец, "Л = ru_RU; НП = Истина; НД = Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек, ж,2");		
		
		ОбластьРасшифровка.Параметры.КапиталНачало = ВыборкаКапитал.КапиталНачало;
		ОбластьРасшифровка.Параметры.КапиталКонец = ВыборкаКапитал.КапиталКонец;	
	КонецЕсли;	  
	
	ВыборкаПереходнаМСФО9 = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ПереходНаМСФО9").ПолучитьДанные().Выбрать();
	Пока ВыборкаПереходнаМСФО9.Следующий() Цикл 
	
	Если ВыборкаПереходнаМСФО9.СуммаПерехода <> 0 Тогда
		ОбластьОтчет.Параметры.ПереходНаМСФО9 = ", с учетом суммы разницы первого применения МСФО 9 в размере " +
			ВыборкаПереходнаМСФО9.СуммаПерехода + " (" +  
			СтрЗаменить(ЧислоПрописью(ВыборкаПереходнаМСФО9.СуммаПерехода, "Л = ru_RU; НП = Истина; НД = Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек, ж,2"), "-", "минус ") + ")."; 
	Иначе	
		ОбластьОтчет.Параметры.ПереходНаМСФО9 = "."; 
	КонецЕсли;    
	КонецЦикла;
	
	ВыборкаФинрез = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ФинРез").ПолучитьДанные().Выбрать();
	Если ВыборкаФинрез.Следующий() Тогда 
		ОбластьОтчет.Параметры.ФинРез = ВыборкаФинрез.Сумма;
		ОбластьОтчет.Параметры.ФинРезПропись = ЧислоПрописью(МатематическиеФункции.МодульЧисла(ВыборкаФинрез.Сумма), "Л = ru_RU; НП = Истина; НД = Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек, ж,2");	
		ОбластьРасшифровка.Параметры.ФинРез = ВыборкаФинрез.Сумма;		
	КонецЕсли;	
	
	ВыборкаПрирост = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Прирост").ПолучитьДанные().Выбрать();
	Если ВыборкаПрирост.Следующий() Тогда 
		ОбластьОтчет.Параметры.Прирост = МатематическиеФункции.МодульЧисла(ВыборкаПрирост.Сумма);
		ОбластьОтчет.Параметры.ПриростПропись = ЧислоПрописью(МатематическиеФункции.МодульЧисла(ВыборкаПрирост.Сумма), "Л = ru_RU; НП = Истина; НД = Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек, ж,2");	
		Если МатематическиеФункции.ЗнакЧисла(ВыборкаПрирост.Сумма) > 0 Тогда 
			ОбластьОтчет.Параметры.ПриростТекст = "прирост";
		Иначе 
			ОбластьОтчет.Параметры.ПриростТекст = "уменьшение"; 
		КонецЕсли;	
		ОбластьРасшифровка.Параметры.Прирост = ВыборкаПрирост.Сумма;		
	КонецЕсли;	
	
	ВыборкаВводыВыводы = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ВводыВыводы").ПолучитьДанные().Выбрать();
	СуммаВводы = 0; СуммаВыводы = 0;
	СуммаВводыДС = 0; СуммаВыводыДС = 0;
	СуммаВводыЦБ = 0; СуммаВыводыЦБ = 0;
	Дебиторка = 0; Кредиторка = 0;
	
	Пока ВыборкаВводыВыводы.Следующий() Цикл 
		СуммаВводы = СуммаВводы + ВыборкаВводыВыводы.Вводы;
		СуммаВыводы = СуммаВыводы + ВыборкаВводыВыводы.Выводы;
		
		Если ВыборкаВводыВыводы.Наименование = "денежные средства" Тогда 
			СуммаВводыДС = СуммаВводыДС + ВыборкаВводыВыводы.Вводы;
			СуммаВыводыДС = СуммаВыводыДС + ВыборкаВводыВыводы.Выводы;
		ИначеЕсли ВыборкаВводыВыводы.Наименование = "задолженность" Тогда 
			Дебиторка = Дебиторка + ВыборкаВводыВыводы.Вводы;
			Кредиторка = Кредиторка + ВыборкаВводыВыводы.Выводы;
		ИначеЕсли ВыборкаВводыВыводы.Наименование = "ценные бумаги" Тогда 
			СуммаВводыЦБ = СуммаВводыЦБ + ВыборкаВводыВыводы.Вводы;
			СуммаВыводыЦБ = СуммаВыводыЦБ + ВыборкаВводыВыводы.Выводы;
		Конецесли;
	КонецЦикла;	
	
	ОбластьОтчет.Параметры.СуммаВводы = СуммаВводы;
	ОбластьОтчет.Параметры.СуммаВводыПропись = ЧислоПрописью(СуммаВводы, "Л = ru_RU; НП = Истина; НД = Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек, ж,2");
	ОбластьОтчет.Параметры.СуммаВыводы = СуммаВыводы;
	ОбластьОтчет.Параметры.СуммаВыводыПропись = ЧислоПрописью(СуммаВыводы, "Л = ru_RU; НП = Истина; НД = Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек, ж,2");
	
	ОбластьРасшифровка.Параметры.СуммаВводы = СуммаВводы;				
	ОбластьРасшифровка.Параметры.СуммаВыводы = СуммаВыводы;				
	ОбластьРасшифровка.Параметры.СуммаВводыДС = СуммаВводыДС;				
	ОбластьРасшифровка.Параметры.СуммаВыводыДС = СуммаВыводыДС;				
	ОбластьРасшифровка.Параметры.Дебиторка = Дебиторка;				
	ОбластьРасшифровка.Параметры.Кредиторка = Кредиторка;				
	ОбластьРасшифровка.Параметры.СуммаВводыЦБ = СуммаВводыЦБ;				
	ОбластьРасшифровка.Параметры.СуммаВыводыЦБ = СуммаВыводыЦБ;				
	
	
	ВознаграждениеДепозитария = 0;
	ВознаграждениеУК = 0;
	РасходыДепозитария = 0;
	
	ВыборкаВознаграждения = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Вознаграждения").ПолучитьДанные().Выбрать();
	Пока ВыборкаВознаграждения.Следующий() Цикл
		Если ВыборкаВознаграждения.Наименование = "Вознаграждение депозитария" Тогда
			ВознаграждениеДепозитария = ВознаграждениеДепозитария + ВыборкаВознаграждения.Сумма;
		ИначеЕсли ВыборкаВознаграждения.Наименование = "Вознаграждение управляющей компании" Тогда
			ВознаграждениеУК = ВознаграждениеУК + ВыборкаВознаграждения.Сумма;
		ИначеЕсли ВыборкаВознаграждения.Наименование = "Расходы депозитария" Тогда	
			РасходыДепозитария = РасходыДепозитария + ВыборкаВознаграждения.Сумма;
		КонецЕсли;	
	КонецЦикла;	
	СуммаИные = РасходыДепозитария;
	
	
	ВыборкаКомиссии = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Комиссии").ПолучитьДанные().Выбрать();
	КомиссияПокупка = 0;
	КомиссияПродажа = 0;
	КомиссияРЕПО = 0;
	КомиссияБанка = 0;
	КомиссияПрочая = 0;
	 
	Пока ВыборкаКомиссии.Следующий() Цикл
		СуммаИные = СуммаИные + ВыборкаКомиссии.Сумма; 
		
		Если ВыборкаКомиссии.Наименование = "комиссия покупка" Тогда
			КомиссияПокупка = КомиссияПокупка + ВыборкаКомиссии.Сумма; 	
		ИначеЕсли ВыборкаКомиссии.Наименование = "комиссия продажа" Тогда
			КомиссияПродажа = КомиссияПродажа + ВыборкаКомиссии.Сумма; 	
		ИначеЕсли ВыборкаКомиссии.Наименование = "комиссия РЕПО" Тогда
			КомиссияРЕПО = КомиссияРЕПО + ВыборкаКомиссии.Сумма; 	
		ИначеЕсли ВыборкаКомиссии.Наименование = "комиссия банка" Тогда
			КомиссияБанка = КомиссияБанка + ВыборкаКомиссии.Сумма; 	
		ИначеЕсли ВыборкаКомиссии.Наименование = "прочие комиссии" Тогда
			КомиссияПрочая = КомиссияПрочая + ВыборкаКомиссии.Сумма; 				
		КонецЕсли;	
	КонецЦикла;	
	
	Если НЕ (ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний
			ИЛИ ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний) Тогда
		ОбластьОтчет.Параметры.СуммаИные = СуммаИные;
		ОбластьОтчет.Параметры.СуммаИныеПропись = ЧислоПрописью(СуммаИные, "Л = ru_RU; НП = Истина; НД = Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек, ж,2");
	КонецЕсли;	
	
	ОбластьРасшифровка.Параметры.СуммаИные = СуммаИные;				
	ОбластьРасшифровка.Параметры.КомиссияПокупка = КомиссияПокупка;				
	ОбластьРасшифровка.Параметры.КомиссияПродажа = КомиссияПродажа;				
	ОбластьРасшифровка.Параметры.КомиссияРЕПО = КомиссияРЕПО;				
	ОбластьРасшифровка.Параметры.КомиссияБанка = КомиссияБанка;		
	ОбластьРасшифровка.Параметры.КомиссияПрочая = КомиссияПрочая;	
	ОбластьРасшифровка.Параметры.РасходыДепозитария = РасходыДепозитария;	
	
	Отказ = Ложь;
	ВознаграждениеНачисляетсяВБазеБухгалтерии = РегистрыСведений.УсловияДоговоровДоверительногоУправления.ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания, Отказ);
	
	Если Не Отказ И ВознаграждениеНачисляетсяВБазеБухгалтерии Тогда 
		
		ТаблицаВознаграждениеУК = РаботаСВнешнимиСистемами.ПолучитьДанныеБухгалтерииОВознагражденииУК("Начисленное", ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);

		Если ТаблицаВознаграждениеУК = Неопределено Тогда
			
			Если Сессия <> Неопределено Тогда
				РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
			КонецЕсли;
			
			Возврат;
		Иначе
			ВознаграждениеУК = ТаблицаВознаграждениеУК.Итог("Сумма");
		КонецЕсли; 	
		
	КонецЕсли;	

	Если НЕ (ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов 
		ИЛИ ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний
		ИЛИ ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний) Тогда
		ОбластьОтчет.Параметры.ВознаграждениеДепозитария = ВознаграждениеДепозитария;
		ОбластьОтчет.Параметры.ВознаграждениеДепозитарияПропись = ЧислоПрописью(ВознаграждениеДепозитария, "Л = ru_RU; НП = Истина; НД = Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек, ж,2");
	КонецЕсли;	
	ОбластьОтчет.Параметры.ВознаграждениеУК = ВознаграждениеУК;
	ОбластьОтчет.Параметры.ВознаграждениеУКПропись = ЧислоПрописью(ВознаграждениеУК, "Л = ru_RU; НП = Истина; НД = Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек, ж,2");
	
	ОбластьРасшифровка.Параметры.ВознаграждениеДепозитария = ВознаграждениеДепозитария;				
	ОбластьРасшифровка.Параметры.ВознаграждениеУК = ВознаграждениеУК;				
	
	ДокументРезультат.Вывести(ОбластьОтчет);
	ДокументРасшифровка.Вывести(ОбластьРасшифровка);
	
	// подписи
	ОбластьПодписи =  Отчет.ПолучитьОбласть("Подписи");	
	ОбластьПодписи.Параметры.НаименованиеКлиентКраткое = СведенияОбОрганизации.КраткоеНаименование;
	ОбластьПодписи.Параметры.НаименованиеУК_Краткое = СведенияОбОрганизации.НаименованиеОрганизации;	
	
	Если ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями  
		ИЛИ ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами  
		ИЛИ ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов Тогда 
		ОбластьПодписи.Параметры.Фонд = "Фонд";
	ИначеЕсли ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний 
		ИЛИ ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний Тогда	
		ОбластьПодписи.Параметры.Фонд = "Страховая компания";	
	КонецЕсли;	
	
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхПодписантОтКлиента") Тогда 
		СтруктураДанныхПодписантОтКлиента = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхПодписантОтКлиента;	
		Если ЗначениеЗаполнено(СтруктураДанныхПодписантОтКлиента) Тогда
			ОбластьПодписи.Параметры.ПодписантКлиент = ВернутьФИОПодписанта(
				СтруктураДанныхПодписантОтКлиента.КонтактноеЛицо, 
				Ложь, 
				ЭтотОбъект.Период.ДатаОкончания, 
				ЭтотОбъект.Организация).ФИОСокращенно;
		КонецЕсли;	
	КонецЕсли;	
				
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхРуководитель") Тогда 
		СтруктураДанныхРуководитель = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхРуководитель;	
		Если ЗначениеЗаполнено(СтруктураДанныхРуководитель) Тогда
			ОбластьПодписи.Параметры.ПодписантУК = ВернутьФИОПодписанта(
				СтруктураДанныхРуководитель.КонтактноеЛицо, 
				Истина, 
				ЭтотОбъект.Период.ДатаОкончания, 
				ЭтотОбъект.Организация).ФИОСокращенно;		
		КонецЕсли;	
	КонецЕсли;
	ДокументРезультат.Вывести(ОбластьПодписи);
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, "Отчет.ИтоговыйОтчет", , ОриентацияСтраницы.Портрет);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецПроцедуры	

Функция ПолучитьДатуПервогоВвода()
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(ВводДенежныхСредств.Дата, ДЕНЬ) КАК Дата
	|ИЗ
	|	Документ.ВводДенежныхСредств КАК ВводДенежныхСредств
	|ГДЕ
	|	ВводДенежныхСредств.Организация = &Организация
	|	И ВводДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(ВводЦенныхБумаг.Дата, ДЕНЬ)
	|ИЗ
	|	Документ.ВводЦенныхБумаг КАК ВводЦенныхБумаг
	|ГДЕ
	|	ВводЦенныхБумаг.Организация = &Организация
	|	И ВводЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Дата;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции
